{
  "id" : 13,
  "userId" : 1,
  "timestamp" : "2025-02-19T16:20:06.094269664",
  "query" : "the most popular iranian movies",
  "movies" : [ {
    "original_title" : "بادکنک سفید",
    "release_date" : "1995-02-02",
    "overview" : "Several people try to take advantage of a little girl's innocence to hustle money her mom gave to her to buy a goldfish with.",
    "vote_average" : "7.5"
  }, {
    "original_title" : "A Separation",
    "release_date" : "2019-08-03",
    "overview" : "On a warm autumn day in 1990, Huixian, a young Chinese woman, arrives in Florida to reunite with her PhD husband, after a four-year separation. Filled with blossoming hope and desire, she is introduced to another side of American life.",
    "vote_average" : "7.0"
  }, {
    "original_title" : "بچه‌های آسمان",
    "release_date" : "1997-08-01",
    "overview" : "Zohre's shoes are gone; her older brother Ali lost them. They are poor, there are no shoes for Zohre until they come up with an idea: they will share one pair of shoes. School awaits.",
    "vote_average" : "7.9"
  }, {
    "original_title" : "آواز گنجشک‌ها",
    "release_date" : "2008-10-01",
    "overview" : "When an ostrich-rancher focuses on replacing his daughter's hearing aid, which breaks right before crucial exams, everything changes for a struggling rural family in Iran. Karim motorbikes into a world alien to him - incredibly hectic Tehran, where sudden opportunities for independence, thrill and challenge him. But his honor and honesty, plus traditional authority over his inventive clan, are tested, as he stumbles among vast cultural and economic gaps between his village nestled in the desert, and a throbbing international metropolis.",
    "vote_average" : "7.587"
  }, {
    "original_title" : "درباره الی‎‎",
    "release_date" : "2009-06-06",
    "overview" : "The mysterious disappearance of a kindergarten teacher during a picnic in the north of Iran is followed by a series of misadventures for her fellow travelers.",
    "vote_average" : "7.455"
  } ]
}