{
  "id" : 15,
  "userId" : 5,
  "timestamp" : "2025-02-20T08:32:19.595412226",
  "query" : "I would like to watch some cool animations with my 8 year-old son",
  "movies" : [ {
    "original_title" : "How to Train Your Dragon",
    "release_date" : "2025-06-11",
    "overview" : "On the rugged isle of Berk, where Vikings and dragons have been bitter enemies for generations, Hiccup stands apart, defying centuries of tradition when he befriends Toothless, a feared Night Fury dragon. Their unlikely bond reveals the true nature of dragons, challenging the very foundations of Viking society.",
    "vote_average" : "0.0"
  }, {
    "original_title" : "Kung Fu Panda",
    "release_date" : "2008-06-04",
    "overview" : "When the Valley of Peace is threatened, lazy Po the panda discovers his destiny as the \"chosen one\" and trains to become a kung fu hero, but transforming the unsleek slacker into a brave warrior won't be easy. It's up to Master Shifu and the Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- to give it a try.",
    "vote_average" : "7.296"
  }, {
    "original_title" : "Toy Story",
    "release_date" : "1995-11-22",
    "overview" : "Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's heart, Woody plots against Buzz. But when circumstances separate Buzz and Woody from their owner, the duo eventually learns to put aside their differences.",
    "vote_average" : "7.969"
  }, {
    "original_title" : "Au pan coupé",
    "release_date" : "1968-02-07",
    "overview" : "Jeanne looks back on her love for Jean. The melancholic young man wouldn't accept the world as it was, always wishing to depart. She doesn't know that he's dead.",
    "vote_average" : "7.3"
  }, {
    "original_title" : "The Incredibles",
    "release_date" : "2004-10-27",
    "overview" : "Bob Parr has given up his superhero days to log in time as an insurance adjuster and raise his three children with his formerly heroic wife in suburbia. But when he receives a mysterious assignment, it's time to get back into costume.",
    "vote_average" : "7.709"
  } ]
}