{
  "id" : 16,
  "userId" : 6,
  "timestamp" : "2025-02-20T10:52:25.353629787",
  "query" : "I would like to watch some cool animations with my 8 year old son",
  "movies" : [ {
    "original_title" : "How to Train Your Dragon",
    "release_date" : "2010-03-18",
    "overview" : "As the son of a Viking leader on the cusp of manhood, shy Hiccup Horrendous Haddock III faces a rite of passage: he must kill a dragon to prove his warrior mettle. But after downing a feared dragon, he realizes that he no longer wants to destroy it, and instead befriends the beast – which he names Toothless – much to the chagrin of his warrior father.",
    "vote_average" : "7.835"
  }, {
    "original_title" : "Kung Fu Panda",
    "release_date" : "2008-06-04",
    "overview" : "When the Valley of Peace is threatened, lazy Po the panda discovers his destiny as the \"chosen one\" and trains to become a kung fu hero, but transforming the unsleek slacker into a brave warrior won't be easy. It's up to Master Shifu and the Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- to give it a try.",
    "vote_average" : "7.296"
  }, {
    "original_title" : "Coco",
    "release_date" : "2017-10-27",
    "overview" : "Despite his family’s baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.",
    "vote_average" : "8.206"
  }, {
    "original_title" : "The Incredibles",
    "release_date" : "2004-10-27",
    "overview" : "Bob Parr has given up his superhero days to log in time as an insurance adjuster and raise his three children with his formerly heroic wife in suburbia. But when he receives a mysterious assignment, it's time to get back into costume.",
    "vote_average" : "7.709"
  }, {
    "original_title" : "Au pan coupé",
    "release_date" : "1968-02-07",
    "overview" : "Jeanne looks back on her love for Jean. The melancholic young man wouldn't accept the world as it was, always wishing to depart. She doesn't know that he's dead.",
    "vote_average" : "7.3"
  } ]
}