{
  "id" : 5,
  "userId" : 4,
  "timestamp" : "2025-02-19T14:32:20.64213804",
  "query" : "I want to watch some movies my teenager friends",
  "movies" : [ {
    "original_title" : "The Hunger Games",
    "release_date" : "2012-03-12",
    "overview" : "Every year in the ruins of what was once North America, the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games.  Part twisted entertainment, part government intimidation tactic, the Hunger Games are a nationally televised event in which “Tributes” must fight with one another until one survivor remains.  Pitted against highly-trained Tributes who have prepared for these Games their entire lives, Katniss is forced to rely upon her sharp instincts as well as the mentorship of drunken former victor Haymitch Abernathy.  If she’s ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love. The world will be watching.",
    "vote_average" : "7.214"
  }, {
    "original_title" : "Mufasa: The Lion King",
    "release_date" : "2024-12-18",
    "overview" : "Mufasa, a cub lost and alone, meets a sympathetic lion named Taka, the heir to a royal bloodline. The chance meeting sets in motion an expansive journey of a group of misfits searching for their destiny.",
    "vote_average" : "7.5"
  }, {
    "original_title" : "Deadpool",
    "release_date" : "2016-02-09",
    "overview" : "The origin story of former Special Forces operative turned mercenary Wade Wilson, who, after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
    "vote_average" : "7.623"
  }, {
    "original_title" : "Jurassic Park",
    "release_date" : "1993-06-11",
    "overview" : "A wealthy entrepreneur secretly creates a theme park featuring living dinosaurs drawn from prehistoric DNA. Before opening day, he invites a team of experts and his two eager grandchildren to experience the park and help calm anxious investors. However, the park is anything but amusing as the security systems go off-line and the dinosaurs escape.",
    "vote_average" : "8.0"
  }, {
    "original_title" : "Avengers: Endgame",
    "release_date" : "2019-04-24",
    "overview" : "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.",
    "vote_average" : "8.2"
  }, {
    "original_title" : "The Dark Knight Rises",
    "release_date" : "2012-07-17",
    "overview" : "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
    "vote_average" : "7.8"
  }, {
    "original_title" : "Spider-Man: Homecoming",
    "release_date" : "2017-07-05",
    "overview" : "Following the events of Captain America: Civil War, Peter Parker, with the help of his mentor Tony Stark, tries to balance his life as an ordinary high school student in Queens, New York City, with fighting crime as his superhero alter ego Spider-Man as a new threat, the Vulture, emerges.",
    "vote_average" : "7.3"
  }, {
    "original_title" : "Black Panther",
    "release_date" : "2018-02-13",
    "overview" : "King T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new leader. However, T'Challa soon finds that he is challenged for the throne by factions within his own country as well as without. Using powers reserved to Wakandan kings, T'Challa assumes the Black Panther mantle to join with ex-girlfriend Nakia, the queen-mother, his princess-kid sister, members of the Dora Milaje (the Wakandan 'special forces') and an American secret agent, to prevent Wakanda from being dragged into a world war.",
    "vote_average" : "7.4"
  }, {
    "original_title" : "Inception",
    "release_date" : "2010-07-15",
    "overview" : "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
    "vote_average" : "8.369"
  } ]
}